import Head from 'next/head'
import Header from '@components/Header'
import Footer from '@components/Footer'

export default function Home() {
  return (
    <div className="container">
      <Head>
        <title>Next.js Starter!</title>
        <link rel="icon" href="/favicon.ico" />
      </Head>

      <main>
        <Header title="Welcome to my app!" />
        <p className="description">
        11
يحتوي ايفون 11 على شاشة خاصية ليكيد ريتينا التي ظهرت لأول مرة في الجيل السابق في ايفون اكس ار. تبلغ الدقة 1792 × 828  بكسل ، وبقياس 6.1 بوصة قطريًا ، تعادل 326 بكسل في البوصة. للمقارنة ، تحتوي الموديلات المحترفة على 458  مع شاشات اوليد الخاصة بهم.

توفر لوحة خاصية ليكيد ريتينا اتش دي لسيدي  أيضًا نفس ميزات مثل نظيراتها من اوليد ، ولكنها أقل سطوعًا قليلا
يكون الإطار المحيط بالجزء الخارجي من الشاشة أكثر سمكًا قليلاً مما هو عليه في الموديلات المحترفة ولكنه لا يزال مؤهلاً كشاشة من الحافة إلى الحافة.

يحتوي ايفون 11 على مجموعة كاميرات خلفية مزدوجة العدسة بدقة 12 ميجابكسل مع عدسات بزاوية عريضة وزاوية عريضة للغاية. العدسة فائقة الاتساع هي عدسة ƒ / 4.2 مع مجال رؤية 120 درجة وزوم بصري 2x.

        </p>
    <a href="https://sevenimgs.com/%d8%ae%d9%84%d9%81%d9%8a%d8%a7%d8%aa-%d8%a7%d9%8a%d9%81%d9%88%d9%86-%d8%b3%d9%88%d8%af%d8%a7%d8%a1/" target="_blank">خلفيات ايفون سوداء</a>
    
    <p className="description">
        
العدسة ذات الزاوية العريضة عبارة عن عدسة بزاوية عريضة ƒ / 1.8. عند العمل جنبًا إلى جنب ، تكون عدسات الكاميرا الخلفية قادرة على التقاط صور بوضع عمودي لا تعتمد على اكتشاف الوجه كما فعلت الأجيال السابقة من ايفون.

يحتوي ايفون 11 أيضًا على وضع إضاءة خافتة جديد يسمح للمستخدم بالتقاط صور أكثر إشراقًا مع ضوضاء منخفضة ووضوح محسّن في بيئات الإضاءة المنخفضة.

في أكتوبر 2019 ، أصدرت Apple ميزة كاميرا ايفون تسمى Deep Fusion والتي تستخدم التعلم الآلي لمعالجة الصور. Deep Fusion لا يواجه المستخدم ويعمل في الخلفية تلقائيًا عند استيفاء معايير معينة. لن يعمل Deep Fusion إذا قام المستخدم بتمكين "التقاط الصور خارج الإطار" ضمن الإعدادات> الكاميرا ، ولن يعمل في حالة استخدام العدسة فائقة الاتساع

        </p>
    
    <a href="https://sevenimgs.com/%d8%ae%d9%84%d9%81%d9%8a%d8%a7%d8%aa-%d8%a7%d9%8a%d9%81%d9%88%d9%86-%d9%81%d8%ae%d9%85%d9%87/" target="_blank">خلفيات ايفون فخمة</a>
    
    <p className="description">
        
يستخدم Deep Fusion عادة للمشاهد ذات الإضاءة دون المستوى الأمثل. ستؤدي سيناريوهات الإضاءة المثلى إلى تشغيل Smart HDR بدلاً من ذلك. عندما يتم استيفاء معايير Deep Fusion ، سيقوم ايفون بتصوير تسع صور ، ويجمعها المحرك العصبي Neural Engine في صورة واحدة ، مع إعطاء الأولوية للتفاصيل والقضاء على الضوضاء.

كما هو الحال مع الأجيال السابقة ، فهو يدعم الفيديو بدقة 4K بمعدل 60 إطارًا في الثانية ، والفيديو البطيء 1080 بكسل بمعدل يصل إلى 240 إطارًا في الثانية.

الجديد أيضًا ، ميزة تكبير الصوت ، والتي تسمح لميكروفون ايفون بمطابقة الصوت مع مقدار تكبير الفيديو. عندما يقوم المستخدم بالتكبير بالقرب من الموضوع ، سيرتفع الصوت المصاحب أيضًا.

تدعم جميع أجهزة ايفون وضع البانوراما ، ووضع الاندفاع ، والفاصل الزمني ، والتعرف على الوجه ، وتثبيت الصورة الرقمية والبصرية ، والتركيز التلقائي ، وفلاش

        </p>
    
    
    
      </main>

      <Footer />
    </div>
  )
}
